app/Http/Controllers/NilaiController.php

    public function where()
    {
        //Mencari nilai dengan kondisi, denga menggunakan method where
        $nilai = Nilai::where('sem_3', '>', 2)->first();
---
select * from `nilais` where `sem_3` > 2 limit 1

    public function whereChaining()
    {
        //Dengan menggunakan method where chaining
        echo $nilai = Nilai::where('sem_2', '>', 3)->first()->mahasiswa->nama;
---
select * from `nilais` where `sem_2` > 3 limit 1

    public function has()
    {
        //Menampilkan semua nilai yang dimiliki oleh Mahasiswa
        $nilais = Nilai::has('mahasiswa')->get();
---
select * from `nilais` where exists (select * from `mahasiswas` where `nilais`.`mahasiswa_id` = `mahasiswas`.`id`)

    public function hasEager()
    {
        $nilais = Nilai::with('mahasiswa')->has('mahasiswa')->get();
---
select * from `mahasiswas` where `mahasiswas`.`id` in (1, 3, 4, 8, 9)
select * from `nilais` where exists (select * from `mahasiswas` where `nilais`.`mahasiswa_id` = `mahasiswas`.`id`)

    public function testInput4()
    {

        // Ini bisa karena mahasiswa dengan id 5 sudah ada dan belum memiliki nilai
        $nilai = new Nilai;
        $nilai->sem_1 = 3.12;
        $nilai->sem_2 = 3.23;
        $nilai->sem_3 = 3.34;
        $nilai->mahasiswa_id = 5;
        $nilai->save();
---
insert into `nilais` (`sem_1`, `sem_2`, `sem_3`, `mahasiswa_id`, `updated_at`, `created_at`) values (3.12, 3.23, 3.34, 5, '2021-09-24 14:15:45', '2021-09-24 14:15:45')

    public function associateNew()
    {
        $mahasiswa = new \App\Models\Mahasiswa;
        $mahasiswa->nim = '19005011';
        $mahasiswa->nama = 'Rina Yusuf';
        $mahasiswa->jurusan = 'Pertanian';
        $mahasiswa->save();

        $nilai = new Nilai;
        $nilai->sem_1 = 3.00;
        $nilai->sem_2 = 4.00;
        $nilai->sem_3 = 3.55;

        $nilai->mahasiswa()->associate($mahasiswa);
        $nilai->save();
---
insert into `mahasiswas` (`nim`, `nama`, `jurusan`, `updated_at`, `created_at`) values ('19005011', 'Rina Yusuf', 'Pertanian', '2021-09-24 14:27:38', '2021-09-24 14:27:38')
insert into `nilais` (`sem_1`, `sem_2`, `sem_3`, `mahasiswa_id`, `updated_at`, `created_at`) values (3, 4, 3.55, 11, '2021-09-24 14:27:38', '2021-09-24 14:27:38')

    public function associateFind()
    {
        $mahasiswa = \App\Models\Mahasiswa::find(7);

        $nilai = new Nilai;
        $nilai->sem_1 = 3.55;
        $nilai->sem_2 = 3.88;
        $nilai->sem_3 = 3.11;

        $nilai->mahasiswa()->associate($mahasiswa);
        $nilai->save();
---
insert into `nilais` (`sem_1`, `sem_2`, `sem_3`, `mahasiswa_id`, `updated_at`, `created_at`) values (3.55, 3.88, 3.11, 7, '2021-09-24 14:33:29', '2021-09-24 14:33:29')

    public function delete()
    {
        //Apabila kita menghapus data dari tabel nilai maka tidak ada masalah referential integrity, tetapi tidak sebaliknya.
        $nilai = Nilai::find(4);
        $nilai->delete();
---
delete from `nilais` where `id` = 4

    public function deleteMahasiswa()
    {
        $nilai = Nilai::find(2);
        $nilai->delete();
---
delete from `nilais` where `id` = 2